case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       149297;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       149397;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       149447;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26356;
        startFace       149497;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2528;
        startFace       175853;
    }
)

// ************************************************************************* //
